{
    "version": "1.3.0",
    "changes": {
        "database": [],
        "files": [],
        "bugs": [
            "Updates to the admin panel styling",
            "Added encryption to the email password in the database. To update it, resave the email configuration settings.",
            "Can now send test emails in administrator settings to check your email configuration",
            "Made the error page mobile-friendly!  Woo!",
            "Added security to admin only features.  They are exclusive to the admin panel, as they should've been.",
            "Added a way to view logs.  Theamus Admin -> Settings -> More (top right) -> View logs",
            "Introduced the Call->load_class() function which allows you to load multiple classes on a page load - documentation/system/including_classes.txt",
            "Theamus AJAX now has a dev/min version for developer mode/production mode.",
            "You can now use dot notation to run functions in admin windows instead",
            "Fixed the page title and prevented a random '-' before the site name",
            "Added a way to avoid redundant queries when looking for table name prefixes using the DB->table() function.  https://github.com/aelieo/Theamus/issues/81",
            "Trims any trailing underscores before attaching the table name to the table prefix in the DB->table() function. https://github.com/aelieo/Theamus/issues/80",
            "Trims the trailing slash from the url on the global JS variable Theamus.base_url. https://github.com/aelieo/Theamus/issues/82",
            "Fixed the Theme->extra_page_navigation() function recurse issue. https://github.com/aelieo/Theamus/issues/79",
            "Added more options to the clause generator: <, >, <=, >=, !% (NOT LIKE). https://github.com/aelieo/Theamus/issues/77",
            "Class files can now live in the root of the feature. https://github.com/aelieo/Theamus/issues/76",
            "Changed the Files->scan_folder function to be able to recurse into directories when looking for folders as well as returning both folders and files.",
            "Fixed an issue where the Theamus class wasn't being included in blank content pages. - https://github.com/aelieo/Theamus/issues/83",
            "Somehow the Notify javascript function was removed.  It's back!! - https://github.com/aelieo/Theamus/issues/85 & https://github.com/aelieo/Theamus/issues/86",
            "Updated the auto-updater to be of the latest and greatest version - https://github.com/aelieo/Theamus/issues/84",
            "Fixed an issue where admin tabs wouldn't load which was caused by #82 - https://github.com/aelieo/Theamus/issues/87",
            "Added a 'root only' option to stop recursion when scanning folders - https://github.com/aelieo/Theamus/issues/88",
            "The admin window tabs now support dropdowns for more awesome! - https://github.com/aelieo/Theamus/issues/74",
            "Admin windows now resize automatically - https://github.com/aelieo/Theamus/issues/49",
            "Loaded admin windows reload on page navigation - https://github.com/aelieo/Theamus/issues/56",
            "Fixed an issue with identifying IE11 as a browser",
            "Name replacement",
            "Added the ability to use [func] in database queries to avoid adding quotes around values - https://github.com/aelieo/Theamus/issues/96",
            "parseInt to parseFloat when pausing between interated ajax calls using the Theamus.Ajax.iterate_calls() function - https://github.com/aelieo/Theamus/issues/95",
            "Added some forgotten slashes that would prevent admin windows from loading - https://github.com/aelieo/Theamus/issues/97",
            "Updated the installation button text from 'Database Configuration' to something more appropriate - https://github.com/aelieo/Theamus/issues/91",
            "Updated queries that used 'now()' to act appropriately with the new changed to the query generator - https://github.com/aelieo/Theamus/issues/99",
            "Updated the default theme to work with <code> and prettyprint.  Also updated the default theme to work a smidgen better on mobile devices - https://github.com/aelieo/Theamus/issues/90",
            "Added the ability to track the load runtime using Theamus->get_run_time() - https://github.com/aelieo/Theamus/issues/89"
        ]
    },
    "authors": [
        ["ælieo", "aelieo", "aelieo@theamus.com"]
    ],
    "run_update_script": true,
    "update_files": ["update-functions.php", "update.php"]
}
