{
    "version": "1.3",
    "changes": {
        "database": [],
        "files": [],
        "bugs": [
            "Fixed the issue in the HTACCESS file where periods were causing internal server errors - https://github.com/Eyraahh/Theamus/issues/24",
            "Created a way to be able to connect to custom databases using the Theamus Data class - https://github.com/Eyraahh/Theamus/issues/23",
            "Create text-only links for nagivation items - https://github.com/Eyraahh/Theamus/issues/21",
            "Took prettyprint off of auto-initialize.",
            "Added a license",
            "Fixed an issue where feature tables weren't being dropped when removing a feature",
            "Added a few meta tags to the 'empty' layout for the default theme",
            "Fixed an issue where the editor pop up windows weren't loading any content - https://github.com/Eyraahh/Theamus/issues/32",
            "Fixed a few issues with the editor stylings - now set a max height and other formatting to provide a more consistent experience",
            "Fixed the editor's headers to be <h#> tags instead of spans, and stop deleting content after changing text to a header/back to normal - https://github.com/Eyraahh/Theamus/issues/33",
            "Added an 'About Theamus' page to say thanks to people helping me develop this system - https://github.com/Eyraahh/Theamus/issues/27",
            "When updating pages, any associated links will have their paths updated as well - https://github.com/Eyraahh/Theamus/issues/25",
            "Shows more detailed information to users with 'developer mode' on when installing/updating/removing features - https://github.com/Eyraahh/Theamus/issues/22",
            "Updated the permissions on creating/editing users and groups.  You can't create users to groups you don't already belong do and you can't create groups with permissions you don't have - https://github.com/Eyraahh/Theamus/issues/20",
            "Shows the feature version on the feature listing page and the version/notes on the edit page - https://github.com/Eyraahh/Theamus/issues/16",
            "Error page 'go back to the site' link goes to the home page of the site - https://github.com/Eyraahh/Theamus/issues/36",
            "Major overhaul to the Administration panel - https://github.com/Eyraahh/Theamus/issues/39",
            "Fixed a few issues with the Pagination class",
            "Updated the Theamus theme.css style",
            "Rewrote the Accounts feature providing style and security updates - https://github.com/Eyraahh/Theamus/issues/37",
            "Decreased the amount of database calls/queries by 44% on page load - https://github.com/Eyraahh/Theamus/issues/42",
            "Updated the pagination class to show page links in a more pretty way while opening some customization to how they show - https://github.com/Eyraahh/Theamus/issues/41",
            "The admin panel can live on the left side of the page or the right side - https://github.com/Eyraahh/Theamus/issues/44",
            "Changed where the script loaded for the default theme - https://github.com/Eyraahh/Theamus/issues/45",
            "Compressed the system Javascript files into one file, each with their own ling - https://github.com/Eyraahh/Theamus/issues/46",
            "Added more compression to the default theme CSS files - https://github.com/Eyraahh/Theamus/issues/47",
            "Fixed the issue where refreshing admin windows would change all of the ones that were open - https://github.com/Eyraahh/Theamus/issues/48",
            "Updated the Administration Theme - https://github.com/Eyraahh/Theamus/issues/43",
            "Not going to lie, I did some fancy stuff with the classes.  From cluttered to beauty. - https://github.com/Eyraahh/Theamus/issues/40",
            "Updated the btn-primary class styling from a light color to a darker one - https://github.com/Eyraahh/Theamus/issues/51",
            "Fixed an issue where multiple HR's in the Feature defined navigation weren't all showing. https://github.com/Eyraahh/Theamus/issues/57",
            "Added a nice pretty message that will show up on a blank page when Theamus can't connect to a database - https://github.com/Eyraahh/Theamus/issues/50",
            "Changed the users table back to the way it was. - https://github.com/Eyraahh/Theamus/issues/58",
            "Changes the user-sessions table to the way DB tables should be - https://github.com/Eyraahh/Theamus/issues/53",
            "Fixed the admin panel styling issues when a page was loaded. - https://github.com/Eyraahh/Theamus/issues/52",
            "Added a system logging class - https://github.com/Eyraahh/Theamus/issues/55",
            "Rewrote the Default feature - https://github.com/Eyraahh/Theamus/issues/61",
            "Rewrote the Accounts feature - https://github.com/Eyraahh/Theamus/issues/59",
            "Rewrote the Pages feature - https://github.com/Eyraahh/Theamus/issues/66",
            "Rewrote the Groups feature - https://github.com/Eyraahh/Theamus/issues/63"
        ]
    },
    "authors": [
        ["Eyrah Temet", "Eyraahh", "info@theamus.com"]
    ],
    "run_update_script": true,
    "update_files": ["update-functions.php", "update.php"]
}
